Функция ПолучитьНепоказанныеУведомления() Экспорт
	НепоказанныеУведомления = Новый Массив;
	ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();

	Если ТекущийСотрудник = Неопределено Тогда
		Возврат НепоказанныеУведомления;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомленияПользователей.Период КАК Период,
		|	УведомленияПользователей.Заявка КАК Заявка,
		|	УведомленияПользователей.ТипУведомления КАК ТипУведомления,
		|	УведомленияПользователей.ТекстУведомления КАК ТекстУведомления
		|ИЗ
		|	РегистрСведений.УведомленияПользователей КАК УведомленияПользователей
		|ГДЕ
		|	УведомленияПользователей.Получатель = &Получатель 
		|	И УведомленияПользователей.Прочитано = ЛОЖЬ   
		|	И УведомленияПользователей.Обработано = ЛОЖЬ
		|	И УведомленияПользователей.ДатаПоказа = &ПустаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период ВОЗР";
	
	Запрос.УстановитьПараметр("Получатель", ТекущийСотрудник);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УведомлениеПользователя = Новый Структура;
		УведомлениеПользователя.Вставить("Период", Выборка.Период);
		УведомлениеПользователя.Вставить("Заявка", Выборка.Заявка);
		УведомлениеПользователя.Вставить("ТипУведомления", Выборка.ТипУведомления);
		УведомлениеПользователя.Вставить("ТекстУведомления", Выборка.ТекстУведомления);
		НепоказанныеУведомления.Добавить(УведомлениеПользователя);
	КонецЦикла;

    Возврат НепоказанныеУведомления;
КонецФункции

Функция ОтметитьУведомленияПоказанными(Уведомления) Экспорт
	
	Возврат УправлениеУведомлениямиСервер.ОтметитьУведомленияПоказанными(Уведомления);
	
КонецФункции

Функция ОтметитьУведомлениеПрочитанным(Период, Заявка, ТипУведомления) Экспорт
	
	Возврат УправлениеУведомлениямиСервер.ОтметитьУведомлениеПрочитанным(Период, Заявка, ТипУведомления);
	
КонецФункции