&НаКлиенте
Процедура ПроверитьНовыеУведомления() Экспорт
	НовыеУведомления = УправлениеУведомлениямиВызовСервера.ПолучитьНепоказанныеУведомления();	
    Если НовыеУведомления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Уведомление Из НовыеУведомления Цикл
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Уведомление.Заявка);
	    ПоказатьОповещениеПользователя(Уведомление.ТекстУведомления, НавигационнаяСсылка, "1С Service Desk", , СтатусОповещенияПользователя.Важное);	
	КонецЦикла;  
	
	УведомленияОтмечены = УправлениеУведомлениямиВызовСервера.ОтметитьУведомленияПоказанными(НовыеУведомления);

	Если НЕ УведомленияОтмечены Тогда
		Сообщить("Не удалось сохранить дату показа уведомлений."); 
    КонецЕсли;
КонецПроцедуры       

&НаКлиенте
Процедура ПриНачалеРаботыСистемы()
	ПроверитьНовыеУведомления();
	ПодключитьОбработчикОжидания("ПроверитьНовыеУведомления", 60, Ложь);
КонецПроцедуры

