Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДанныеЗаявки = УправлениеОборудованиемСервер.ПолучитьДанныеЗаявкиДляРаботыСОборудованием(Заявка);

	Если ДанныеЗаявки = Неопределено Тогда
		Сообщить("Не удалось получить данные связанной заявки.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ДанныеЗаявки.ТекущийСтатус <> Перечисления.СтатусыЗаявок.ОжидаетОборудование Тогда	
		Сообщить("Выдача оборудования возможна только по заявке в статусе ""Ожидает оборудование"".");		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сотрудник <> ДанныеЗаявки.Заявитель Тогда
		Сообщить("Оборудование можно закрепить только за заявителем.");			
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗаявки.Оборудование) И Оборудование = ДанныеЗаявки.Оборудование Тогда	
		Сообщить("Нельзя оформить выдачу проблемного оборудования. Для него необходимо использовать документ ремонта.");			
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	МоментДоДокумента = Новый Граница(МоментВремени(), ВидГраницы.Исключая);                      
	ТекущееСостояние = УправлениеОборудованиемСервер.ПолучитьТекущееСостояниеОборудования(Оборудование, МоментДоДокумента, Ссылка);
	
	Если ТекущееСостояние = Неопределено Тогда
		Сообщить("Не удалось определить текущее состояние оборудования.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекущееСостояние.Состояние <> Перечисления.СостоянияОборудования.НаСкладе Тогда
		Сообщить("Выбранное оборудование нельзя закрепить, поскольку оно не находится на складе.");	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.ИсторияСостоянийОборудования.Записывать = Истина;
	Движение = Движения.ИсторияСостоянийОборудования.Добавить();
	
	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.Состояние = Перечисления.СостоянияОборудования.Используется;
	Движение.ЗакрепленоЗа = Сотрудник;
	Движение.Заявка = Заявка;
	Движение.Комментарий = СокрЛП(Комментарий);
	Движение.Оформил = Оформил;  
КонецПроцедуры   

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Оформил) Тогда
		Попытка
		Оформил = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();

		Исключение
			Сообщить("Не удалось определить сотрудника, оформляющего закрепление. " + ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
	
		Если Не ЗначениеЗаполнено(Оформил) Тогда
			Сообщить("Пользователь ИБ не связан с активным сотрудником.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;  
	КонецЕсли;
КонецПроцедуры

