Функция ПолучитьТекущегоСотрудника() Экспорт
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПользовательИБ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;  
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИмяПользователяИБ = &ИмяПользователяИБ
		|	И Сотрудники.Активен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ИмяПользователяИБ", ПользовательИБ.Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Сотрудник = Выборка.Сотрудник;
	
	Если Выборка.Следующий() Тогда
		ВызватьИсключение
			"Одному пользователю информационной базы соответствует несколько активных сотрудников.";
	КонецЕсли;
	
	Возврат Сотрудник;
	
КонецФункции

Функция ПолучитьРуководителейIT() Экспорт
	
	РуководителиIT = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Активен = ИСТИНА
		|	И Сотрудники.ЯвляетсяРуководителемIT = ИСТИНА
		|	И Сотрудники.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РуководителиIT.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат РуководителиIT;
	
КонецФункции

Функция ПолучитьОтветственныхЗаОборудование() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ПометкаУдаления = ЛОЖЬ
		|	И Сотрудники.ОтветственныйЗаОборудование = ИСТИНА";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Ответственные = Новый Массив;

	Пока Выборка.Следующий() Цикл
		Ответственные.Добавить(Выборка.Сотрудник);
	КонецЦикла;

	Возврат Ответственные;

КонецФункции