&НаСервере
Процедура ДобавитьУсловиеОтбора(КоллекцияЭлементов, ИмяПоля, Значение)

	ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);

	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура НастроитьОтборЗаявокПоРолям(Отказ)

	ЭтоАдминистратор = РольДоступна("АдминистраторСистемы");
	ЭтоРуководитель = РольДоступна("РуководительITОтдела");
	ЭтоСотрудник = РольДоступна("ПользовательСотрудник");
	ЭтоИсполнитель = РольДоступна("ИсполнительЗаявок");
    ЭтоОтветственныйЗаОборудование = РольДоступна("ОтветственныйЗаОборудование");
	
	Если ЭтоАдминистратор ИЛИ ЭтоРуководитель Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоСотрудник И НЕ ЭтоИсполнитель И НЕ ЭтоОтветственныйЗаОборудование Тогда
		Сообщить("Для текущей роли просмотр заявок пока не настроен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Попытка
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
	Исключение
		Сообщить("Не удалось определить текущего сотрудника. " + ОписаниеОшибки());
		Отказ = Истина;
		Возврат;
	КонецПопытки;

	Если ТекущийСотрудник = Неопределено Тогда
		Сообщить("Пользователь ИБ не связан с активным сотрудником.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	Если ЭтоОтветственныйЗаОборудование И НЕ ТекущийСотрудник.ОтветственныйЗаОборудование Тогда	
		Сообщить("У текущего сотрудника не установлен признак ""Ответственный за оборудование"".");		
		Отказ = Истина;
		Возврат;
	КонецЕсли;	

	Отбор = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;

	КоличествоУсловий = 0;

	Если ЭтоСотрудник Тогда
		КоличествоУсловий = КоличествоУсловий + 1;
	КонецЕсли;

	Если ЭтоИсполнитель Тогда
		КоличествоУсловий = КоличествоУсловий + 1;
	КонецЕсли;

	Если ЭтоОтветственныйЗаОборудование Тогда
		КоличествоУсловий = КоличествоУсловий + 1;
	КонецЕсли;

	КоллекцияЭлементов = Отбор.Элементы;

	Если КоличествоУсловий > 1 Тогда	
		ГруппаОтбора = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.Использование = Истина;	
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		КоллекцияЭлементов = ГруппаОтбора.Элементы;		
	КонецЕсли;

	Если ЭтоСотрудник Тогда
		ДобавитьУсловиеОтбора(КоллекцияЭлементов, "Заявитель", ТекущийСотрудник);
	КонецЕсли;

	Если ЭтоИсполнитель Тогда
		ДобавитьУсловиеОтбора(КоллекцияЭлементов, "Исполнитель", ТекущийСотрудник);
	КонецЕсли;

	Если ЭтоОтветственныйЗаОборудование Тогда
		ДобавитьУсловиеОтбора(КоллекцияЭлементов, "ТекущийСтатус", Перечисления.СтатусыЗаявок.ОжидаетОборудование);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьОтборЗаявокПоРолям(Отказ);
КонецПроцедуры