Функция ПолучитьТекущееСостояниеОборудования(Оборудование, МоментПолучения, ИсключаемыйРегистратор = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Оборудование) Тогда
		Сообщить("Не заполнено оборудование.");
	    Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МоментПолучения) Тогда
		Сообщить("Не заполнен момент получения.");
	    Возврат Неопределено;
	КонецЕсли; 
	
	УсловиеСреза = "Оборудование = &Оборудование";

	Если ЗначениеЗаполнено(ИсключаемыйРегистратор) Тогда
		УсловиеСреза = УсловиеСреза + " И Регистратор <> &ИсключаемыйРегистратор";
	КонецЕсли;
	
	ИсходныйПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсторияСостоянийОборудованияСрезПоследних.Состояние КАК Состояние,
			|	ИсторияСостоянийОборудованияСрезПоследних.ЗакрепленоЗа КАК ЗакрепленоЗа
			|ИЗ
			|	РегистрСведений.ИсторияСостоянийОборудования.СрезПоследних(&МоментПолучения, " + УсловиеСреза + ") КАК ИсторияСостоянийОборудованияСрезПоследних";
		
		Запрос.УстановитьПараметр("МоментПолучения", МоментПолучения);
		Запрос.УстановитьПараметр("Оборудование", Оборудование);
		Если ЗначениеЗаполнено(ИсключаемыйРегистратор) Тогда
			Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
		КонецЕсли;
	
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
	Исключение
	    Сообщить("Не удалось получить текущее состояние оборудования. "	+ ОписаниеОшибки());			
		Возврат Неопределено;     
		
	КонецПопытки;  
	
	УстановитьПривилегированныйРежим(ИсходныйПривилегированныйРежим);
	
	СостояниеОборудования = Новый Структура;
	Если Не Выборка.Следующий() Тогда
		СостояниеОборудования.Вставить("Состояние", Перечисления.СостоянияОборудования.НаСкладе);  
		СостояниеОборудования.Вставить("ЗакрепленоЗа", Справочники.Сотрудники.ПустаяСсылка()); 
		Возврат СостояниеОборудования;
	КонецЕсли;
	
	СостояниеОборудования.Вставить("Состояние", Выборка.Состояние);  
	СостояниеОборудования.Вставить("ЗакрепленоЗа", Выборка.ЗакрепленоЗа); 

	Возврат СостояниеОборудования;
КонецФункции

Функция ПолучитьДанныеЗаявкиДляРаботыСОборудованием(Заявка) Экспорт
	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не заполнена заявка.");
	    Возврат Неопределено;
	КонецЕсли; 
	
    Попытка
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ITЗаявка.Заявитель КАК Заявитель,
		|	ITЗаявка.Оборудование КАК Оборудование,
		|	ITЗаявка.ТекущийСтатус КАК ТекущийСтатус,
		|	ITЗаявка.Исполнитель КАК Исполнитель
		|ИЗ
		|	Документ.ITЗаявка КАК ITЗаявка
		|ГДЕ
		|	ITЗаявка.Ссылка = &Заявка
		|	И ITЗаявка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Исключение
		Сообщить("Не удалось получить данные заявки. "	+ ОписаниеОшибки());			
    	Возврат Неопределено;  
	КонецПопытки;
	
	ДанныеЗаявки = Новый Структура;

	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЗаявки.Вставить("Заявитель", Выборка.Заявитель);
	ДанныеЗаявки.Вставить("Оборудование", Выборка.Оборудование);
	ДанныеЗаявки.Вставить("ТекущийСтатус", Выборка.ТекущийСтатус);
	ДанныеЗаявки.Вставить("Исполнитель", Выборка.Исполнитель); 
	
	Возврат ДанныеЗаявки;
КонецФункции

Функция ЕстьЗавершеннаяОперацияПоОборудованию(Заявка) Экспорт

	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИсторияСостоянийОборудованияСрезПоследних.Оборудование КАК Оборудование
			|ИЗ
			|	РегистрСведений.ИсторияСостоянийОборудования.СрезПоследних(
			|		&МоментПроверки, ) КАК ИсторияСостоянийОборудованияСрезПоследних
			|ГДЕ
			|	ИсторияСостоянийОборудованияСрезПоследних.Заявка = &Заявка
			|	И ИсторияСостоянийОборудованияСрезПоследних.Состояние = &Состояние";

		Запрос.УстановитьПараметр("МоментПроверки", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияОборудования.Используется);

		Выборка = Запрос.Выполнить().Выбрать();

		Возврат Выборка.Следующий();

	Исключение
		Сообщить("Не удалось проверить операции по оборудованию. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции